Диплом/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполененныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаПрописью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
		
		Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
			
			КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
			КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
			КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
			КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
			
			Возврат КомандаСоздатьНаОсновании;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
		
		
	КонецФункции 
	
	Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
		НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	КонецПроцедуры
	
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		// Акт об оказании услуг
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "УправлениеПечатью";
		КомандаПечати.Идентификатор = "Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслуг";
		КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
		КомандаПечати.Порядок = 5;
		
	КонецПроцедуры
		
	#КонецОбласти   
	
	#Область СлужебныеПроцедурыИФункции
	Функция СоздатьДокументРеализации(Договор,Параметр) Экспорт  
		
		Ревизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"Владелец, Организация");  
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = Параметр.Дата;
		НовыйДокумент.Контрагент = Ревизиты.Владелец;
		НовыйДокумент.Организация = Ревизиты.Организация;
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокумент.Записать();
		Возврат НовыйДокумент;
		
	КонецФункции 
	
	Функция  СозданиеДокумента(Выборка, Массив, Параметр) Экспорт 
		
		НовыйДокумент = СоздатьДокументРеализации(Выборка.Договор,Параметр);
		Если НовыйДокумент.ПроверитьЗаполение() = Истина Тогда 
		НовыйДокумент.ВыполнитьАвтозаполнение(); 
		//Вообщение понятия не имею как отключить заполнение "Основания"
		НовыйДокумент.ПроверитьЗаполнение();

		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		
		ДобавитьСтруктуру = Новый Структура;
		ДобавитьСтруктуру.Вставить("Документ",НовыйДокумент.Ссылка);
		ДобавитьСтруктуру.Вставить("Договор",Выборка.Договор);
		Массив.Добавить(ДобавитьСтруктуру);
		
	КонецФункции 
	Функция ЗаполнениеДокумента( Выборка, Массив)Экспорт 
		
		Документ = Выборка.Документ.ПолучитьОбъект();
		Документ.ВыполнитьАвтозаполнение(); 
		Документ.ПроверитьЗаполнение();
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
		
		//Надо ли передавать эти данные в таьличную часть Обработки???
		ДобавитьСтруктуру = Новый Структура;
		ДобавитьСтруктуру.Вставить("Документ",Выборка.Документ);
		ДобавитьСтруктуру.Вставить("Договор",Выборка.Договор);
		Массив.Добавить(ДобавитьСтруктуру);
		
	КонецФункции
		
	#КонецОбласти   
#КонецЕсли
